<a href="https://colab.research.google.com/github/crzysab/Python-Pandas/blob/main/Pandas_17.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Resampling pada data deret waktu | time series data**

___

Import Modules

In [1]:
import pandas as pd
import numpy as np

Persiapan Data Frame

In [2]:
n_rows = 365 * 24
n_cols = 2
cols = ['cols1', 'cols2']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                  columns=cols)

df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
df

                     cols1  cols2
2000-01-01 00:00:00      7      5
2000-01-01 01:00:00      5     14
2000-01-01 02:00:00      6     18
2000-01-01 03:00:00     10     17
2000-01-01 04:00:00      9     11
...                    ...    ...
2000-12-30 19:00:00      6      1
2000-12-30 20:00:00     19      1
2000-12-30 21:00:00     10      6
2000-12-30 22:00:00      2     14
2000-12-30 23:00:00      4     14

[8760 rows x 2 columns]

Resampling data dengan interval 'Monthly'

In [4]:
df.resample('M')['cols1'].sum().to_frame()

            cols1
2000-01-31   7403
2000-02-29   7051
2000-03-31   7736
2000-04-30   6796
2000-05-31   7411
2000-06-30   7224
2000-07-31   7362
2000-08-31   7426
2000-09-30   7156
2000-10-31   7541
2000-11-30   7169
2000-12-31   7192

Resampling data dengan interval 'Daily'

In [5]:
df.resample('D')['cols1'].sum().to_frame()

            cols1
2000-01-01    191
2000-01-02    254
2000-01-03    280
2000-01-04    244
2000-01-05    237
...           ...
2000-12-26    223
2000-12-27    278
2000-12-28    230
2000-12-29    252
2000-12-30    259

[365 rows x 1 columns]